challenge3/webapp/goi/lib/tasks/csv_import.rake

INSERT INTO `houses` (`id`, `first_name`, `last_name`, `city`, `num_of_people`, `has_child`, `created_at`, `updated_at`) VALUES (2, 'Jennifer', 'Martinez', 'Cambridge', 3, FALSE, '2020-07-10 17:18:51.947801', '2020-07-10 17:18:51.947801')
INSERT INTO `energies` (`id`, `label`, `house_id`, `year`, `month`, `temperature`, `daylight`, `energy_production`, `created_at`, `updated_at`) VALUES (1, 0, 1, 2011, 7, 26.2, 178.9, 740, '2020-07-10 17:22:15.289118', '2020-07-10 17:22:15.289118')
---
def file_import(file_name: nil, title: nil)
  raise ArgumentError if file_name.nil? || title.nil?

  # path = File.join Rails.root, "db/csv/#{file_name}"
  path = File.join Rails.root, "lib/tasks/#{file_name}"
  puts "-- File Path: #{path}"

  import_data = eval("#{title}_csv_import(path: '#{path}')")
  puts '-- csv import start'

  begin
    if title == 'house'
      House.create!(import_data)
    elsif title == 'energy'
      Energy.create!(import_data)