challengeA/shota_imoto/app/models/plan.rb

  def calculate_usage_charge(power_consumption)
    sum_usage_charge = 0
    self.usage_charges.each do |usage_charge|
---
SELECT `usage_charges`.* FROM `usage_charges` WHERE `usage_charges`.`plan_id` = 1