challengeA/shota_imoto/app/models/simulator.rb

  def simulate
    plans = Plan.all.includes(:provider, :basic_charges, :usage_charges)
    simulation_results = []
    plans.each do |plan|

      # find suitable basic charge for current
      # FIXME: Make me readable!! This code confuses developers, "what's happen??"
      basic_charge = plan.basic_charges.find{|basic_charge| basic_charge.current == self.current_i}
---
SELECT `usage_charges`.* FROM `usage_charges` WHERE `usage_charges`.`plan_id` = 1
SELECT `plans`.* FROM `plans`
SELECT `providers`.* FROM `providers` WHERE `providers`.`id` IN (1, 2, 3)
SELECT `basic_charges`.* FROM `basic_charges` WHERE `basic_charges`.`plan_id` = 3