challenge3/webapp/goi/app/models/house.rb

SELECT COUNT(energy_production temperature city) AS count_energy_production_temperature_city, `houses`.`city` AS houses_city FROM `houses` INNER JOIN `energies` ON `energies`.`house_id` = `houses`.`id` GROUP BY `houses`.`city` ORDER BY city
SELECT AVG(energy_production) AS average_energy_production, year AS year, month AS month, `houses`.`city` AS houses_city FROM `houses` INNER JOIN `energies` ON `energies`.`house_id` = `houses`.`id` GROUP BY year, month, `houses`.`city`
---
  scope :house_city_counts, -> {joins(:energies).select('city').group('city').order('city').count}
  scope :city_energy_production, -> {joins(:energies).group('year').group('month').group('city').average('energy_production')}