challenge3/webapp/shimakura/app/controllers/energies_controller.rb

  def index
    @energies = Energy.all.page(params[:page]).per(15)
---
SELECT "energies".* FROM "energies" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "energies"

  def create
    @energy = Energy.new(energy_params)

    respond_to do |format|
      if @energy.save
---
INSERT INTO "energies" ("label", "year", "month", "temperature", "daylight", "energy_production", "house_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @energy.update(energy_params)
---
UPDATE "energies" SET "house_id" = ?, "updated_at" = ? WHERE "energies"."id" = ?  [["house_id", 49], ["updated_at", "2019-10-14 10:35:54.953718"], ["id", 1195]]

  def destroy
    @energy.destroy
---
DELETE FROM "energies" WHERE "energies"."id" = ?  [["id", 1]]

    def set_energy
      @energy = Energy.find(params[:id])
---
SELECT "energies".* FROM "energies" WHERE "energies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]