challenge3/webapp/shimakura/app/controllers/houses_controller.rb

SELECT "energies".* FROM "energies" WHERE "energies"."house_id" = ?  [["house_id", 1]]
---
  def show
    @house = House.find(params[:id])
    @energy_list = []
    @temperature_list = []
    @daylight_list = []
    @energy_production_list = []
    @house.energies.each do |energy|

INSERT INTO "houses" ("firstname", "lastname", "city", "num_of_people", "has_child", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["firstname", "aaaa"], ["lastname", "a"], ["city", "a"], ["num_of_people", -1], ["has_child", "aa"], ["created_at", "2019-10-14 07:43:06.919739"], ["updated_at", "2019-10-14 07:43:06.919739"]]
---
  def create
    @house = House.new(house_params)

    respond_to do |format|
      if @house.save

UPDATE "houses" SET "num_of_people" = ?, "updated_at" = ? WHERE "houses"."id" = ?  [["num_of_people", 3], ["updated_at", "2019-10-14 08:43:23.924080"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @house.update(house_params)

DELETE FROM "houses" WHERE "houses"."id" = ?  [["id", 2]]
---
  def destroy
    @house.destroy