challenge3/webapp/liang/app/controllers/csv_controller.rb

SELECT "datasets".* FROM "datasets"
---
  def index
    @house_data = HouseDatum.all
    @dataset = Dataset.all

    # sqlでデータを集計
    # City別エネルギー生産量
    if @house_data.present? &&  @dataset.present? then