challenge3/webapp/liang/app/models/dataset.rb

	def self.import(file)
		table = CSV.table(file.path, headers: true)
		table.each do |row|
			# IDが見つかれば、レコードを呼び出し、見つかれなければ、新しく作成
			data = find_by(id: row[:id]) || new
			# CSVからデータを取得し、設定する
			data.attributes = row.to_h.map{|k,v| [k.to_s, v] }.to_h.slice(*updatable_attributes)
			# 保存する
			data.save
---
INSERT INTO "datasets" ("label", "house", "year", "month", "temperature", "daylight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["label", 0], ["house", 1], ["year", 2011], ["month", 7], ["temperature", 26], ["daylight", 178], ["created_at", "2020-07-31 02:32:01.467950"], ["updated_at", "2020-07-31 02:32:01.467950"]]
UPDATE "datasets" SET "energyproduction" = $1, "updated_at" = $2 WHERE "datasets"."id" = $3  [["energyproduction", 740], ["updated_at", "2020-07-31 03:19:45.699557"], ["id", 1]]