challengeA/shota_imoto/app/views/plans/index.html.haml

SELECT `basic_charges`.* FROM `basic_charges` WHERE `basic_charges`.`plan_id` = 1
---
        %th 料金単価(消費税率10%)
      - plan.basic_charges.each do |basic_charge|

SELECT `usage_charges`.* FROM `usage_charges` WHERE `usage_charges`.`plan_id` = 1
---
        %th 料金単価(消費税率10%)
      - plan.usage_charges.each do |usage_charge|