challengeA/shota_imoto/app/controllers/basic_charges_controller.rb

SELECT `plans`.* FROM `plans`
SELECT `providers`.* FROM `providers` WHERE `providers`.`id` IN (1, 2, 3)
---
  def new
    @basic_charge = BasicCharge.new
    @plans = Plan.all.includes(:provider)

INSERT INTO `basic_charges` (`current`, `charge`, `plan_id`, `created_at`, `updated_at`) VALUES (10, 286.0, 1, '2020-10-08 01:53:24', '2020-10-08 01:53:24')
---
  def create
    if BasicCharge.create(basic_charge_params)