challengeA/shota_imoto/app/controllers/plans_controller.rb

SELECT `plans`.* FROM `plans`
---
  def index
    @plans = Plan.all

SELECT `providers`.* FROM `providers`
---
  def new
    @plan = Plan.new
    @providers = Provider.all

INSERT INTO `plans` (`name`, `created_at`, `updated_at`, `provider_id`) VALUES ('うんこプラン', '2020-10-08 05:53:53', '2020-10-08 05:53:53', 2)
---
  def create
    if Plan.create(plan_params)