challengeA/shota_imoto/app/controllers/providers_controller.rb

INSERT INTO `providers` (`name`, `created_at`, `updated_at`) VALUES ('東京電力エナジーパートナー', '2020-10-08 05:51:07', '2020-10-08 05:51:07')
---
  def create
    if Provider.create(provider_params)