challengeA/shota_imoto/app/controllers/usage_charges_controller.rb

SELECT `plans`.* FROM `plans`
SELECT `providers`.* FROM `providers` WHERE `providers`.`id` IN (1, 2, 3)
---
  def new
    @usage_charge = UsageCharge.new
    @plans = Plan.all.includes(:provider)

INSERT INTO `usage_charges` (`lower_power`, `upper_power`, `charge`, `plan_id`, `created_at`, `updated_at`) VALUES (0, 120, 19.88, 1, '2020-10-08 01:57:47', '2020-10-08 01:57:47')
---
  def create
    if UsageCharge.create(usage_charge_params)